# -*- coding: utf-8 -*-
"""
Created on Sun Sep 10 14:34:00 2017

@author: yc
"""
#word = 'Words'
#for i in word[::-1]:
#    print(i)
#    
##==============================================================================
## a = [1,2,3,4,5,6,7,8,9]
## print a[1:2:3] #输出为2 ，从下表为1的地方开始到小于小标为2的位置，其中3为步长
## print a[1:4:1]#输出为2，3，4,以上面类似，只是步长为1了
## print a[1::1] #3输出为2，3，4，5，6，7，8，9,中间为空表示默认，则从小标为1到最后
## print a[-1:-4:-1]#反向索引，从最后一位开始放过来取值，注意这里的步长要为-1，因为反向
##==============================================================================
#s = "word"
#print(s[:2])

a = [[1,2],[3,4]]
print([i for i in (for m in a)])